	#include <stdio.h>
int main() {
//나이 : 15
	printf("나이: %d, 학번 : %d\n", 15, 20220222);
	int a;
	a = 15;
	int b;
	a = 5;
	printf("%d\n", a);
	printf("%d\n", 97);
	printf("%c\n", 65);
	
	int x = 5;
	printf("x : %d\n", x + 10);
	printf("x : %d\n", x);
	//공간 = 값;
	return 0;
}
// 자료형 변수이름;
// 변수 : 데이터를 저장할 수 있는 하나의 공간
//변수의 특징
//1. 변수는 선언(정의)되어야만 사용 가능
//2. 변수는 선언되기 전에 변수의 타입을 명시해야만 변수 선언이 가능
//3. 변수는 명시된 타입의 데이터만 할당할 수 있다.
//4. 변수는 중복선언이 불가능하다.
//5. 변수는 재활용 가능하다.
//6. 변수는 오직 하나의 값만 담을 수 있다.
//7. 변수는 대입연산자(=)를 기준으로 좌측에 있을떄는 공간, 우측에 있을땐 값이다.

//리턴타입 함수명(매개변수) {
//	return 리턴값;
//}